Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The TCP header (even one including options) is an integral number of 32 bits long.
zh_cn: TCP 首部(甚至包括选项)是 32 位长的整数倍。

source: The TCP header padding is used to ensure that the TCP header ends and data begins on a 32 bit boundary.
zh_cn: TCP 首部填充用于确保 TCP 首部结束和数据开始在 32 位边界上。

source: The TCP then waits until its own FIN is acknowledged whereupon it deletes the connection.
zh_cn: 然后 TCP 等待，直到它自己的 FIN 被确认，然后删除连接。

source: The TEXT rule is only used for descriptive field contents and values that are not intended to be interpreted by the message parser.
zh_cn: TEXT 规则仅用于描述性字段内容和不打算由消息解析器解释的值。

source: The TLS Handshake Protocol involves the following steps:
zh_cn: TLS 握手协议涉及以下步骤：

source: The TLS Handshake Protocol is one of the defined higher-level clients of the TLS Record Protocol.
zh_cn: TLS 握手协议是 TLS 记录协议的定义的更高级别客户端之一。

source: The TLS Handshake Protocol provides connection security that has three basic properties:
zh_cn: TLS 握手协议提供具有三个基本属性的连接安全性：

source: The TLS Handshaking Protocols
zh_cn: TLS 握手协议

source: The TLS Record Protocol
zh_cn: TLS 记录协议

source: The TLS Record Protocol is a layered protocol.
zh_cn: TLS 记录协议是分层协议。

source: The TLS Record Protocol is used for encapsulation of various higher-level protocols.
zh_cn: TLS 记录协议用于封装各种更高级别的协议。

source: The TLS Record Protocol provides connection security that has two basic properties:
zh_cn: TLS 记录协议提供具有两个基本属性的连接安全性：

source: The TLS handshake establishes one or more input secrets which are combined to create the actual working keying material, as detailed below.
zh_cn: TLS 握手建立一个或多个输入机密，这些输入机密被组合以创建实际的工作密钥材料，如下所述。

source: The TLS protocol is secure in that any cipher suite offers its promised level of security: if you negotiate 3DES with a 1024-bit RSA key exchange with a host whose certificate you have verified, you can expect to be that secure.
zh_cn: TLS 协议是安全的，因为任何加密套件都提供其承诺的安全级别：如果您通过与已验证证书的主机进行 1024 位 RSA 密钥交换来协商 3DES，那么您可以保证安全。

source: The TLS protocol provides communications security over the Internet.
zh_cn: TLS 协议提供了互联网上的通信安全性。

source: The TLS record layer receives uninterpreted data from higher layers in non-empty blocks of arbitrary size.
zh_cn: TLS 记录层从较高层接收任意大小的非空块的未解释数据。

source: The TLS record layer uses a keyed Message Authentication Code (MAC) to protect message integrity.
zh_cn: TLS 记录层使用加密的 (keyed) 消息验证代码 (Message Authentication Code) (MAC)来保护消息完整性。

source: The TLS record protocol takes messages to be transmitted, fragments the data into manageable blocks, protects the records, and transmits the result.
zh_cn: TLS 记录协议接收要传输的消息，将数据分段为可管理的块，保护记录并传输结果。

source: The TLS standard, however, does not specify how protocols add security with TLS; how to initiate TLS handshaking and how to interpret the authentication certificates exchanged are left to the judgment of the designers and implementors of protocols that run on top of TLS.
zh_cn: 但是，TLS 标准没有规定协议如何通过 TLS 增加安全性；如何启动 TLS 握手以及如何解释交换的身份验证证书留给 TLS 之上运行的协议的设计者和实现者的判断。

source: The TLS standard, however, does not specify how protocols add security with TLS; the decisions on how to initiate TLS handshaking and how to interpret the authentication certificates exchanged are left to the judgment of the designers and implementors of protocols that run on top of TLS.
zh_cn: 但是，TLS 标准没有规定协议如何通过 TLS 增加安全性；关于如何启动 TLS 握手以及如何解释所交换的认证证书的决定留给了在 TLS 之上运行的协议的设计者和实现者的判断。

source: The TRACE method is used to invoke a remote, application-layer loop- back of the request message.
zh_cn: TRACE 方法用于调用请求消息的远程应用层环回。

source: The TRACE method requests a remote, application-level loop-back of the request message.
zh_cn: TRACE 方法请求请求消息的远程应用程序级环回。

source: The Trailer header field can be used to indicate which header fields are included in a trailer (see section 14.40).
zh_cn: Trailer 首部字段可用于指示 trailer 中包含哪些首部字段(请参阅第 14.40 节)。

source: The Transfer-Encoding header field lists the transfer coding names corresponding to the sequence of transfer codings that have been (or will be) applied to the payload body in order to form the message body.
zh_cn: Transfer-Encoding 首部字段列出了与已经(或将要)应用于有效载荷主体以形成消息主体的传输编码序列相对应的传输编码名称。

source: The URI characters are, in turn, frequently encoded as octets for transport or presentation.
zh_cn: 反过来，URI 字符经常被编码为用于传输或呈现的八位字节。

source: The URI generic syntax for authority also includes a deprecated userinfo subcomponent ([RFC3986], Section 3.2.1) for including user authentication information in the URI.
zh_cn: 权限的 URI 通用语法还包括不推荐使用的 userinfo 子组件([RFC3986]，第 3.2.1 节)，用于在 URI 中包含用户身份验证信息。

source: The URI in a POST request identifies the resource that will handle the enclosed entity.
zh_cn: POST 请求中的 URI 标识将处理所包含实体的资源。

source: The URI referred to by a relative reference, also known as the target URI, is obtained by applying the reference resolution algorithm of Section 5.
zh_cn: 相对引用所引用的 URI(也称为目标 URI)是通过应用第 5 节的引用解析算法获得的。

source: The URI syntax defines a grammar that is a superset of all valid URIs, allowing an implementation to parse the common components of a URI reference without knowing the scheme-specific requirements of every possible identifier.
zh_cn: URI 语法定义了一个语法，该语法是所有有效 URI 的超集，允许实现解析 URI 引用的公共组件，而不需要知道每个可能标识符的特定于方案的要求。

source: The URI syntax is designed for unambiguous reference to resources and extensibility via the URI scheme.
zh_cn: URI 语法旨在通过 URI 方案明确引用资源和可扩展性。

source: The URI syntax is organized hierarchically, with components listed in order of decreasing significance from left to right.
zh_cn: URI 语法按层次结构组织，组件按从左到右的重要性递减顺序列出。

source: The URI syntax provides a method of encoding data, presumably for the sake of identifying a resource, as a sequence of characters.
zh_cn: URI 语法提供了一种将数据编码的方法，可能是为了识别资源，作为字符序列。

source: The US-ASCII coded character set is defined by ANSI X3.4-1986 [21].
zh_cn: US-ASCII 编码字符集由 ANSI X3.4-1986 [21] 定义。

source: The Upgrade header field only applies to switching protocols on top of the existing connection; it cannot be used to switch the underlying connection (transport) protocol, nor to switch the existing communication to a different connection.
zh_cn: Upgrade 首部字段仅适用于现有连接之上的切换协议；它不能用于切换底层连接(传输)协议，也不能用于将现有通信切换到不同的连接。

source: The `BackpressureOverflow.Strategy` is an interface actually but the class `BackpressureOverflow` offers 4 static fields with implementations of it representing typical actions:
zh_cn: `BackpressureOverflow.Strategy` 实际上是一个接口，但是 `BackpressureOverflow` 类提供了 4 个静态字段，其实现代表了典型的操作：

source: The `BehaviorProcessor` and `PublishProcessor` don't coordinate requests (use `Flowable.publish()` for that) of their downstream subscribers and will signal them `MissingBackpressureException` if the downstream can't keep up.
zh_cn: `BehaviorProcessor` 和 `PublishProcessor` 不协调下游订阅者的请求(如果需要则使用 `Flowable.publish()`)，如果下游无法跟上，则会发出 `MissingBackpressureException` 信号。

source: The `Completable` type remains largely the same.
zh_cn: `Completable` 类型基本保持不变。

source: The `Emitter` is relatively straightforward to use; one can call `onNext`, `onError` and `onComplete` on it and the operator handles backpressure and unsubscription management on its own.
zh_cn: `Emitter` 的使用相对简单；可以在其上调用 `onNext`，`onError` 和 `onComplete`，操作符可以自己处理背压和取消订阅管理。

source: The `FuncN` is replaced by the `Function<Object[], R>` type declaration.
zh_cn: `FuncN` 被 `Function<Object[], R>` 类型声明所取代。

source: The `Maybe` class is accompanied by `MaybeSource` as its base interface type, `MaybeObserver<T>` as its signal-receiving interface and follows the protocol `onSubscribe (onSuccess | onError | onComplete)?`.
zh_cn: `Maybe` 类伴随着 `MaybeSource` 作为其基本接口类型，`MaybeObserver<T>` 作为其信号接收接口，并遵循协议 `onSubscribe (onSuccess | onError | onComplete)?`。

source: The `Schedulers.test()` has been removed as well to avoid the conceptional difference with the rest of the default schedulers.
zh_cn: `Schedulers.test()` 也已被移除，以避免与其他默认调度器的概念差异。

source: The `SerializedSubject` is no longer a public class.
zh_cn: `SerializedSubject` 不再是公共类。

source: The `Thread.sleep(2000);` at the end is no accident.
zh_cn: 最后的 `Thread.sleep(2000);` 不是偶然的。

source: The `computeValue` is called as part of the main routine and not in response to the subscribers subscribing.
zh_cn: `computeValue` 作为主程序的一部分被调用，而不是响应订阅者的订阅。

source: The `fromIterable` also gives an interesting opportunity.
zh_cn: `fromIterable` 也提供了一个有趣的机会。

source: The `immediate` scheduler is not present in 2.x.
zh_cn: `immediate` 调度器不存在于 2.x 中。

source: The `io.reactivex.Scheduler` abstract base class now supports scheduling tasks directly without the need to create and then destroy a `Worker` (which is often forgotten):
zh_cn: `io.reactivex.Scheduler` 抽象基类现在支持直接调度任务，而不需要创建然后销毁 `Worker`(经常被遗忘)：

source: The `io.reactivex.processors.AsyncProcessor`, `io.reactivex.processors.BehaviorProcessor`, `io.reactivex.processors.PublishProcessor`, `io.reactivex.processors.ReplayProcessor` and `io.reactivex.processors.UnicastProcessor` are backpressure-aware.
zh_cn: `io.reactivex.processors.AsyncProcessor`，`io.reactivex.processors.BehaviorProcessor`，`io.reactivex.processors.PublishProcessor`，`io.reactivex.processors.ReplayProcessor` 和 `io.reactivex.processors.UnicastProcessor` 是背压感知的。

source: The `io.reactivex.subjects.AsyncSubject`, `io.reactivex.subjects.BehaviorSubject`, `io.reactivex.subjects.PublishSubject`, `io.reactivex.subjects.ReplaySubject` and `io.reactivex.subjects.UnicastSubject` in 2.x don't support backpressure (as part of the 2.x `Observable` family).
zh_cn: `io.reactivex.subjects.AsyncSubject`，`io.reactivex.subjects.BehaviorSubject`，`io.reactivex.subjects.PublishSubject`，`io.reactivex.subjects.ReplaySubject` 和 `io.reactivex.subjects.UnicastSubject` 在 2.x 中不支持背压(作为 2.x `Observable` 系列的一部分)。

source: The `rx.observables.ConnectableObservable` is now `io.reactivex.observables.ConnectableObservable<T>` and `io.reactivex.flowables.ConnectableFlowable<T>`.
zh_cn: `rx.observables.ConnectableObservable` 现在是 `io.reactivex.observables.ConnectableObservable<T>` 和 `io.reactivex.flowables.ConnectableFlowable<T>`。

source: The `rx.observables.GroupedObservable` is now `io.reactivex.observables.GroupedObservable<T>` and `io.reactivex.flowables.GroupedFlowable<T>`.
zh_cn: `rx.observables.GroupedObservable` 现在是 `io.reactivex.observables.GroupedObservable<T>` 和 `io.reactivex.flowables.GroupedFlowable<T>`。

source: The `set()` method disposes the old value and `replace()` method does not.
zh_cn: `set()` 方法处理旧值，而 'replace()` 方法则不处理。

source: The `test()` method on `TestObserver` has a `test(boolean cancel)` overload which cancels/disposes the `TestSubscriber`/`TestObserver` before it even gets subscribed:
zh_cn: `TestObserver` 上的 `test()` 方法有一个 `test(boolean cancel)` 重载，在它被订阅之前取消/释放 `TestSubscriber`/`TestObserver`：

source: The above categories for intermediary only consider those acting as participants in the HTTP communication.
zh_cn: 上述中间类别仅考虑那些充当 HTTP 通信参与者的类别。

source: The above-described check provides no protection against attacks where this source is compromised.
zh_cn: 上述检查不提供针对源受损的攻击的保护。

source: The absoluteURI form is REQUIRED when the request is being made to a proxy.
zh_cn: 在向代理发出请求时，必须使用 absoluteURI 形式。

source: The acknowledgment mechanism employed is cumulative so that an acknowledgment of sequence number X indicates that all octets up to but not including X have been received.
zh_cn: 所采用的确认机制是累积的，因此序列号 X 的确认表明已经接收到所有八位字节但不包括 X。

source: The action performed by the POST method might not result in a resource that can be identified by a URI.
zh_cn: POST 方法执行的操作可能不会生成可由 URI 标识的资源。

source: The actual "Extension" format is defined in Section 4.2.
zh_cn: 实际的“Extension”格式在 4.2 节中定义。

source: The actual "Extension" format is defined in Section 7.4.1.4.
zh_cn: 实际的“Extension”格式在第 7.4.1.4 节中定义。

source: The actual cause is usually the non-backpressured use of `PublishProcessor`, `timer()` or `interval()` or custom operators created via `create()`.
zh_cn: 实际原因通常是使用 `PublishProcessor`，`timer()` 或 `interval()` 或通过 `create()` 创建的自定义操作符的非背压使用。

source: The actual content type of the record is found in TLSInnerPlaintext.type after decryption.
zh_cn: 解密后，在 TLSInnerPlaintext.type 中找到记录的实际内容类型。

source: The actual contents of the SessionID are defined by the server.
zh_cn: SessionID 的实际内容由服务器定义。

source: The actual function performed by the POST method is determined by the server and is usually dependent on the Request-URI.
zh_cn: POST 方法执行的实际功能由服务器确定，通常依赖于 Request-URI。

source: The actual key exchange uses up to four messages: the server Certificate, the ServerKeyExchange, the client Certificate, and the ClientKeyExchange.
zh_cn: 实际密钥交换最多使用四条消息：服务器 Certificate，ServerKeyExchange，客户端 Certificate 和 ClientKeyExchange。

source: The actual length field consumes two bytes, a uint16, which is sufficient to represent the value 400 (see Section 3.3).
zh_cn: 实际长度字段消耗两个字节，即 uint16，足以表示值 400(参见第 3.3 节)。

source: The actual length field consumes two bytes, a uint16, which is sufficient to represent the value 400 (see Section 4.4).
zh_cn: 实际长度字段消耗两个字节，即 uint16，足以表示值 400(参见第 4.4 节)。

source: The additional authenticated data, which we denote as additional_data, is defined as follows:
zh_cn: 我们将其称为 additional_data 的其他经过身份验证的数据定义如下：

source: The aead_output consists of the ciphertext output by the AEAD encryption operation.
zh_cn: aead_output 由 AEAD 加密操作输出的密文组成。

source: The age of a response is the time since it was sent by, or successfully validated with, the origin server.
zh_cn: 响应的年龄是自原始服务器发送或成功验证以来的时间。

source: The agent acting as the HTTP client should also act as the TLS client.
zh_cn: 充当 HTTP 客户端的代理也应充当 TLS 客户端。

source: The algorithm field specifies the algorithm used (see Section 7.4.1.4.1 for the definition of this field).
zh_cn: 算法字段指定使用的算法(有关此字段的定义，请参见第 7.4.1.4.1 节)。

source: The algorithm field specifies the signature algorithm used (see Section 4.2.3 for the definition of this type).
zh_cn: algorithm 字段指定使用的签名算法(有关此类型的定义，请参见第 4.2.3 节)。

source: The algorithm for determining the message body length has been clarified to indicate all of the special cases (e.g., driven by methods or status codes) that affect it, and that new protocol elements cannot define such special cases.
zh_cn: 已经阐明了用于确定消息体长度的算法以指示影响它的所有特殊情况(例如，由方法或状态代码驱动)，并且新协议元素不能定义这种特殊情况。

source: The algorithm used for generating these items from the security parameters is described in Section 6.3.
zh_cn: 用于从安全参数生成这些项的算法在 6.3 节中描述。

source: The algorithm used to compress data prior to encryption.
zh_cn: 用于在加密之前压缩数据的算法。

source: The application data.
zh_cn: 应用数据。

source: The appropriate validation procedures are defined in Section 4.3.7 of [ECDSA] and alternatively in Section 5.6.2.3 of [KEYAGREEMENT].
zh_cn: 适当的验证程序在 [ECDSA] 的第 4.3.7 节中定义，或者在 [KEYAGREEMENT] 的第 5.6.2.3 节中定义。

source: The asterisk "*" means that the request does not apply to a particular resource, but to the server itself, and is only allowed when the method used does not necessarily apply to a resource.
zh_cn: 星号“*”表示请求不适用于特定资源，而是适用于服务器本身，并且仅在使用的方法不一定适用于资源时才允许。

source: The asterisk-form of request-target is only used for a server-wide OPTIONS request (Section 4.3.7 of [RFC7231]).
zh_cn: 请求目标的星号形式仅用于服务器范围的 OPTIONS 请求([RFC7231] 的第 4.3.7 节)。

source: The asterisk-form of the request-target is only allowed with the OPTIONS method.
zh_cn: 请求目标的星号形式仅允许使用 OPTIONS 方法。

source: The augmented BNF includes the following constructs:
zh_cn: 增强的 BNF 包括以下结构：

source: The authentication, encryption, and MAC algorithms are determined by the cipher_suite selected by the server and revealed in the ServerHello message.
zh_cn: 认证，加密和 MAC 算法由服务器选择并显示在 ServerHello 消息中的 cipher_suite 确定。

source: The authority component is preceded by a double slash ("//") and is terminated by the next slash ("/"), question mark ("?"), or number sign ("#") character, or by the end of the URI.
zh_cn: 权限组件前面有一个双斜杠(“//”)，并由下一个斜杠(“/”)，问号(“?”)或数字符号(“#”)字符终止，或者由 URI 的结束终止。

source: The authority form is only used by the CONNECT method (section 9.9).
zh_cn: authority 形式仅由 CONNECT 方法使用(第 9.9 节)。

source: The authority-form of request-target is only used for CONNECT requests (Section 4.3.6 of [RFC7231]).
zh_cn: 请求目标的权限形式仅用于 CONNECT 请求([RFC7231] 的第 4.3.6 节)。

source: The automatic retry SHOULD NOT be repeated if the second sequence of requests fails.
zh_cn: 如果第二个请求序列失败，则不应重复自动重试。

source: The backslash character ("\") MAY be used as a single-character quoting mechanism only within quoted-string and comment constructs.
zh_cn: 反斜杠字符(“\”)只能在带引号的字符串和注释结构中用作单字符引用机制。

source: The backslash octet ("\") can be used as a single-octet quoting mechanism within quoted-string and comment constructs.
zh_cn: 反斜杠八位字节(“\”)可以用作引号字符串和注释结构中的单八位字节引用机制。

source: The bad news is that one should be careful when performing 'organize imports' as it may select the non-backpressured `io.reactivex.Observable` unintended.
zh_cn: 坏消息是，在执行“组织导入”时应该小心，因为它可能会无意中选择非背压的 `io.reactivex.Observable`。

source: The base classes can be considered heavy due to the sheer number of static and instance methods on them.
zh_cn: 由于基类的静态和实例方法数量庞大，因此可以认为基类很重。

source: The basic data block size is one byte (i.e., 8 bits).
zh_cn: 基本数据块大小是一个字节(即 8 位)。

source: The basic duplicate detection and sequencing algorithm in TCP can be defeated, however, if a source TCP does not have any memory of the sequence numbers it last used on a given connection.
zh_cn: 但是，如果源 TCP 没有最后在给定连接上使用的序列号的任何内存，则可以取消 TCP 中的基本重复检测和排序算法。

source: The basic numeric data type is an unsigned byte (uint8).
zh_cn: 基本数字数据类型是无符号字节(uint8)。

source: The basic unit of HTTP communication, consisting of a structured sequence of octets matching the syntax defined in section 4 and transmitted via the connection.
zh_cn: HTTP 通信的基本单元，由与第 4 节中定义的语法匹配并通过连接传输的结构化八位字节序列组成。

source: The body of the "certificate_authorities" extension consists of a CertificateAuthoritiesExtension structure.
zh_cn: “certificate_authorities”扩展的主体由 CertificateAuthoritiesExtension 结构组成。

source: The body of the variant structure may be given a label for reference.
zh_cn: 可以给变体结构的主体提供标签以供参考。

source: The capabilities and nature of the application-level communication after the protocol change is entirely dependent upon the new protocol(s) chosen.
zh_cn: 协议更改后应用程序级通信的功能和性质完全取决于所选的新协议。

source: The certificate MUST be appropriate for the negotiated cipher suite's key exchange algorithm and any negotiated extensions.
zh_cn: 证书必须适用于协商加密套件的密钥交换算法和任何协商扩展。

source: The certificate MUST be appropriate for the negotiated cipher suite's key exchange algorithm, and any negotiated extensions.
zh_cn: 证书必须适用于协商的加密套件的密钥交换算法，以及任何协商的扩展。

source: The certificate_request_context MUST be unique within the scope of this connection (thus preventing replay of client CertificateVerify messages).
zh_cn: certificate_request_context 必须在此连接的范围内是唯一的(从而防止重放客户端 CertificateVerify 消息)。

source: The change cipher spec protocol exists to signal transitions in ciphering strategies.
zh_cn: 存在更改加密规范协议以用信号通知加密策略中的转换。

source: The change_cipher_spec record is used only for compatibility purposes (see Appendix D.4).
zh_cn: change_cipher_spec 记录仅用于兼容性目的(参见附录 D.4)。

source: The character "*" preceding an element indicates repetition.
zh_cn: 元素前面的字符“*”表示重复。

source: The characters slash ("/") and question mark ("?") are allowed to represent data within the fragment identifier.
zh_cn: 字符斜杠(“/”)和问号(“?”)允许表示片段标识符内的数据。

source: The characters slash ("/") and question mark ("?") may represent data within the query component.
zh_cn: 字符斜杠(“/”)和问号(“/”)可以表示查询组件中的数据。

source: The checksum also covers a 96 bit pseudo header conceptually
zh_cn: 校验和还在 TCP 首部之前，概念性地涵盖了 96 位伪首部

source: The checksum field is the 16 bit one's complement of the one's complement sum of all 16 bit words in the header and text.
zh_cn: 校验和字段是首部和文本中所有 16 位字的反码求和的 16 位反码。

source: The choice of messages depends on which key exchange method has been selected.
zh_cn: 消息的选择取决于选择了哪种密钥交换方法。

source: The chunk-size field is a string of hex digits indicating the size of the chunk.
zh_cn: chunk-size 字段是一个十六进制数字字符串，表示块的大小。

source: The chunked encoding is ended by any chunk whose size is zero, followed by the trailer, which is terminated by an empty line.
zh_cn: 分块编码由任何大小为零的块结束，后跟 trailer，后者由空行终止。

source: The chunked encoding modifies the body of a message in order to transfer it as a series of chunks, each with its own size indicator, followed by an OPTIONAL trailer containing entity-header fields.
zh_cn: 分块编码修改消息正文，以便将其作为一系列块进行传输，每个块都有自己的大小指示器，后跟一个包含实体首部字段的可选尾部。

source: The cipher suite concept has been changed to separate the authentication and key exchange mechanisms from the record protection algorithm (including secret key length) and a hash to be used with both the key derivation function and handshake message authentication code (MAC).
zh_cn: 密码套件概念已经改变，以将认证和密钥交换机制与记录保护算法(包括密钥长度)和要与密钥导出功能和握手消息认证码(MAC)一起使用的散列分开。

source: The cipher suite list, passed from the client to the server in the ClientHello message, contains the combinations of cryptographic algorithms supported by the client in order of the client's preference (favorite choice first).
zh_cn: 在 ClientHello 消息中从客户端传递到服务器的加密套件列表，包含客户端支持的加密算法组合，按客户端的偏号排序(首先是最喜欢的选择)。

source: The cipher suites defined in this document use a construction known as HMAC, described in [HMAC], which is based on a hash function.
zh_cn: 本文档中定义的密码套件使用 [HMAC] 中描述的称为 HMAC 的构造，该构造基于散列函数。

source: The class-based `RxJavaObservableHook` and friends are now gone and `RxJavaHooks` functionality is incorporated into `RxJavaPlugins`.
zh_cn: 基于类 `RxJavaObservableHook` 和朋友现在已经不在了，`RxJavaHooks` 函数被整合到 `RxJavaPlugins` 中。

source: The classic case of the need for backpressure is when the producer is a hot source:
zh_cn: 需要背压的经典案例是当生产者是热源时：

source: The client MAY send the "certificate_authorities" extension in the ClientHello message.
zh_cn: 客户端可以在 ClientHello 消息中发送“certificate_authorities”扩展。

source: The client MUST check EncryptedExtensions for the presence of any forbidden extensions and if any are found MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 客户端必须检查 EncryptedExtensions 是否存在任何禁用扩展，如果发现任何禁用扩展，必须通过“illegal_parameter”警报中止握手。

source: The client MUST send a Certificate message if and only if the server has requested client authentication via a CertificateRequest message (Section 4.3.2).
zh_cn: 当且仅当服务器通过 CertificateRequest 消息请求客户端认证时，客户端必须发送 Certificate 消息(第 4.3.2 节)。

source: The client and the server must share knowledge that the connection is ending in order to avoid a truncation attack.
zh_cn: 客户端和服务器必须共享连接结束的知识，以避免截断攻击。

source: The client can also send a ClientHello in response to a HelloRequest or on its own initiative in order to renegotiate the security parameters in an existing connection.
zh_cn: 客户端还可以发送 ClientHello 以响应 HelloRequest，或主动发送，以便重新协商现有连接中的安全性参数。

source: The client can then use that PSK identity in future handshakes to negotiate the use of the associated PSK.
zh_cn: 然后，客户端可以在将来的握手中使用该 PSK 身份来协商相关 PSK 的使用。

source: The client cannot be guaranteed that the operation has been carried out, even if the status code returned from the origin server indicates that the action has been completed successfully.
zh_cn: 即使从源服务器返回的状态代码指示操作已成功完成，也无法保证客户端已执行该操作。

source: The client is not required to examine or display the Reason-Phrase.
zh_cn: 客户端不需要检查或显示 Reason-Phrase。

source: The client may then initiate the first HTTP request.
zh_cn: 然后，客户端可以发起第一个 HTTP 请求。

source: The client sends a ClientHello using the Session ID of the session to be resumed.
zh_cn: 客户端使用要恢复的会话的会话 ID 发送 ClientHello。

source: The client sends its extension requests in the ClientHello message, and the server sends its extension responses in the ServerHello, EncryptedExtensions, HelloRetryRequest, and Certificate messages.
zh_cn: 客户端在 ClientHello 消息中发送其扩展请求，服务器在 ServerHello，EncryptedExtensions，HelloRetryRequest 和 Certificate 消息中发送其扩展响应。
